// Задача 49: Задайте двумерный массив. Найдите элементы, у которых оба индекса 
// нечётные, и замените эти элементы на их квадраты.
// Например, изначально массив
//  выглядел вот так:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// Новый массив будет выглядеть 
// вот так:
// 1 4 7 2
// 5 81 2 9
// 8 4 2 4

void PrintArray(int[,] array)
{
    for (int i=0;i<array.GetLength(0);i++)
       {
        for (int j=0;j<array.GetLength(1);j++) 
            Console.Write($"{array[i,j],3}\t");
        Console.WriteLine();
       }
}

void FillArray(int[,] array)
{
    for (int i=0;i<array.GetLength(0);i++)
       for (int j=0;j<array.GetLength(1);j++) 
            array[i,j] = new Random().Next(1,11);
}

void SquareArray(int[,] array)
{
    for (int i=1;i<array.GetLength(0);i+=2) // нечетные позиции индексов (i+2 при i=1)
       {
        for (int j=1;j<array.GetLength(1);j+=2) 
             array[i,j] = array[i,j]*array[i,j]; 
       }
}


Console.WriteLine("Введите количество строк двумерного массива");
int rows = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите количество столбцов двумерного массива");
int cols = Convert.ToInt32(Console.ReadLine());
int[,] array = new int [rows,cols];
FillArray(array);
PrintArray(array);
Console.WriteLine();
SquareArray(array);
PrintArray(array);
